let a = prompt('Введіть число від 1 до 12', '');
if (a == 1) {
    alert('Місяць січень, пора року - зима.');
} else if(a == 2) {
    alert('Місяць лютий, пора року - зима.');
} else if(a == 3) {
    alert('Місяць березень, пора року - весна.');
} else if (a == 4){
   alert('Місяць квітень, пора року - весна.');
} else if (a == 5){
    alert('Місяць травень, пора року - весна.');
}else if (a == 6){
    alert('Місяць червень, пора року - літо.'); 
}else if (a == 7){
    alert('Місяць липень, пора року - літо.'); 
} else if(a == 8){
    alert('Місяць серпень, пора року - літо.');
} else if(a == 9){
    alert('Місяць вересень, пора року - осінь.');
} else if(a == 10){
    alert('Місяць жовтень, пора року - осінь.');
} else if(a == 11){
    alert('Місяць листопад, пора року - осінь.');
} else if(a == 12){
    alert('Місяць грудень, пора року - зима.');
} else if((a > 12) || (a < 1)){
    alert('Введіть число від 1 до 12');
} else if (typeof a != Number){
    alert('Введіть число');
} else {
    alert('Введіть інше число');
}

